**** creation :week1:
the simplest way get a pair of gpg key is to create them interactively in a terminal:
#+begin_src bash :eval no
gpg2 --full-generate-key
#+end_src

And that is pretty all with gpg alone, now we can uses this key inside emacs and with other softwares.

Unfortunately maybe your terminal or emacs is not able on your computer to use your graphical server to ask passwords, so you may need to create a key in batch mode instead :

#+begin_src bash :results pp
# temporary prevent history
unset HISTFILE
# comment the next line to make a durable key
export GNUPGHOME="$(mktemp -d)"
# create a specification file in /tmp/crypto
cat > /tmp/crypto <<EOF
     %echo Generating a basic OpenPGP key
     Key-Type: default
     Key-Length: 4096
     Subkey-Type: default
     Subkey-Length: 4096
     Name-Real: John Duh
     Name-Comment: eventually
     Name-Email: mymail@gmail.com.
     Expire-Date: 0
     Passphrase: very-secure-password
     %commit
     %echo done
EOF
# redirection only to get the output in org-mode
2<&1 gpg --batch --generate-key /tmp/crypto
# clear your traces.
rm /tmp/crypto
#+end_src

#+RESULTS:
: gpg: keybox '/tmp/tmp.UdBqBAWACV/pubring.kbx' created
: gpg: Generating a basic OpenPGP key
: gpg: /tmp/tmp.UdBqBAWACV/trustdb.gpg: trustdb created
: gpg: key D084633A29F0D54E marked as ultimately trusted
: gpg: directory '/tmp/tmp.UdBqBAWACV/openpgp-revocs.d' created
: gpg: revocation certificate stored as '/tmp/tmp.UdBqBAWACV/openpgp-revocs.d/F3D6DE5627A10F4D8CDAE84CD084633A29F0D54E.rev'
: gpg: done

**** (optional) sharing our id :week1:
now eventually we can declare ourselves to keyservers. This may be helpful for eg signing a FSF assessment.

first check our fingerprint :
#+begin_src bash :results pp
gpg --fingerprint lazysnail2077@gmail.com
#+end_src

#+RESULTS:
: pub   rsa4096 2021-05-28 [SC]
:       E9AF 49C4 6F8E AE92 139D  F319 4814 7806 2064 2A11
: uid           [ultimate] Lazy Snail <lazysnail2077@gmail.com>
: sub   rsa4096 2021-05-28 [E]
:

E9AF 49C4 6F8E AE92 139D  F319 4814 7806 2064 2A11
is the fingerprint,
4814 7806 2064 2A11
is the long key id
2064 2A11
is the short key id

So finally we can send it to the keyservers of our choice :
#+begin_src bash
gpg2 --keyserver keys.gnupg.net --search "20642A11"
#+end_src

and verify it worked :
#+begin_src bash
gpg2 --keyserver keys.gnupg.net --search "20642A11"
#+end_src

the server should return the mail address we initially specified.

